[
    {
        "Item Type": "preprint",
        "Publication Year": 2025,
        "Author": "Rim, Ellen Y.; Garrett, Oscar D.; Howard, Alexander J.; Shim, Yejin; Li, Yuanyuan; Dyke, Jonathan E. Van; Packer, Ryan C.; Ho, Nguyen; Jain, Rashmi; Stewart, Valley; Dinesh-Kumar, Savithramma P.; Notwell, James H.; Ronald, Pamela C.",
        "Title": "Directed Evolution of a Plant Immune Receptor for Broad Spectrum Effector Recognition",
        "Short Title": "",
        "Publication Title": NaN,
        "DOI": "10.1101/2024.09.30.614878",
        "Url": "https://www.biorxiv.org/content/10.1101/2024.09.30.614878v2",
        "Abstract Note": "Rapid development of immune receptors that protect crops from emerging pathogens is a critical challenge 1,2. While novel immune receptors that recognize previously undetected pathogen effectors could provide protection against a wider range of pathogens, engineering such receptors has been constrained by the low throughput and speed of in planta testing. We established yeast surface display as a high throughput platform to recapitulate plant immune receptor-ligand interactions and evolve new binding capabilities. Using this directed evolution platform, we engineered the ligand binding domain of the rice immune receptor Pik-1 to recognize diverse effectors from the fast-evolving fungal pathogen Magnaporthe oryzae. Our approach yielded Pik-1 ligand binding domains with affinity for variants of the M. oryzae effector Avr-Pik that previously escaped detection by known rice alleles of Pik-1, with in planta assays confirming functional recognition of these effectors. Additional rounds of mutagenesis and selection led to a Pik-1 domain that binds all tested Avr-Pik variants as well as the evolutionarily divergent effector AvrPiz-t. These results demonstrate the potential of directed evolution to engineer immune receptors with new-to-nature recognition of a wide range of pathogen-derived ligands and accelerate development of broad spectrum resistance in crops.",
        "Date": "2025-02-04",
        "Pages": NaN,
        "Issue": NaN,
        "Volume": NaN,
        "Library Catalog": "bioRxiv"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2023,
        "Author": "Eckardt, Nancy A; Ainsworth, Elizabeth A; Bahuguna, Rajeev N; Broadley, Martin R; Busch, Wolfgang; Carpita, Nicholas C; Castrillo, Gabriel; Chory, Joanne; DeHaan, Lee R; Duarte, Carlos M; Henry, Amelia; Jagadish, S V Krishna; Langdale, Jane A; Leakey, Andrew D B; Liao, James C; Lu, Kuan-Jen; McCann, Maureen C; McKay, John K; Odeny, Damaris A; Jorge de Oliveira, Eder; Platten, J Damien; Rabbi, Ismail; Rim, Ellen Youngsoo; Ronald, Pamela C; Salt, David E; Shigenaga, Alexandra M; Wang, Ertao; Wolfe, Marnin; Zhang, Xiaowei",
        "Title": "Climate change challenges, plant science solutions",
        "Short Title": "",
        "Publication Title": "The Plant Cell",
        "DOI": "10.1093/plcell/koac303",
        "Url": "https://doi.org/10.1093/plcell/koac303",
        "Abstract Note": "Climate change is a defining challenge of the 21st century, and this decade is a critical time for action to mitigate the worst effects on human populations and ecosystems. Plant science can play an important role in developing crops with enhanced resilience to harsh conditions (e.g. heat, drought, salt stress, flooding, disease outbreaks) and engineering efficient carbon-capturing and carbon-sequestering plants. Here, we present examples of research being conducted in these areas and discuss challenges and open questions as a call to action for the plant science community.",
        "Date": "2023-01-01",
        "Pages": "24-66",
        "Issue": 1.0,
        "Volume": 35.0,
        "Library Catalog": "Silverchair"
    },
    {
        "Item Type": "preprint",
        "Publication Year": 2025,
        "Author": "Howard, Alexander J.; Rim, Ellen Y.; Garrett, Oscar D.; Shim, Yejin; Notwell, James H.; Ronald, Pamela C.",
        "Title": "Combining Directed Evolution with Machine Learning Enables Accurate Genotype-to-Phenotype Predictions",
        "Short Title": "",
        "Publication Title": NaN,
        "DOI": "10.1101/2025.01.27.635131",
        "Url": "https://www.biorxiv.org/content/10.1101/2025.01.27.635131v1",
        "Abstract Note": "Linking sequence variation to phenotypic effects is critical for efficient exploitation of large genomic datasets. Here we present a novel approach combining directed evolution with protein language modeling to characterize naturally-evolved variants of a rice immune receptor. Using high-throughput directed evolution, we engineered the rice immune receptor Pik-1 to bind and recognize the fungal proteins Avr-PikC and Avr-PikF, which evade detection by currently characterized Pik-1 alleles. A protein language model was fine-tuned on this data to correlate sequence variation with ligand binding behavior. This modeling was then used to characterize Pik-1 variants found in the 3,000 Rice Genomes Project dataset. Two variants scored highly for binding against Avr-PikC, and in vitro analyses confirmed their improved ligand binding over the wild-type Pik-1 receptor. Overall, this machine learning approach identified promising sources of disease resistance in rice and shows potential utility for exploring the phenotypic variation of other proteins of interest.",
        "Date": "2025-01-29",
        "Pages": NaN,
        "Issue": NaN,
        "Volume": NaN,
        "Library Catalog": "bioRxiv"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2022,
        "Author": "Ercoli, Maria Florencia; Luu, Dee Dee; Rim, Ellen Youngsoo; Shigenaga, Alexandra; Teixeira de Araujo, Artur; Chern, Mawsheng; Jain, Rashmi; Ruan, Randy; Joe, Anna; Stewart, Valley; Ronald, Pamela",
        "Title": "Plant immunity: Rice XA21-mediated resistance to bacterial infection",
        "Short Title": "Plant immunity",
        "Publication Title": "Proceedings of the National Academy of Sciences",
        "DOI": "10.1073/pnas.2121568119",
        "Url": "https://www.pnas.org/doi/full/10.1073/pnas.2121568119",
        "Abstract Note": "In this article, we describe the development of the plant immunity field, starting with efforts to understand the genetic basis for disease resistance, which ~30 y ago led to the discovery of diverse classes of immune receptors that recognize and respond to infectious microbes. We focus on knowledge gained from studies of the rice XA21 immune receptor that recognizes RaxX (required for activation of XA21 mediated immunity X), a sulfated microbial peptide secreted by the gram-negative bacterium Xanthomonas oryzae pv. oryzae. XA21 is representative of a large class of plant and animal immune receptors that recognize and respond to conserved microbial molecules. We highlight the complexity of this large class of receptors in plants, discuss a possible role for RaxX in Xanthomonas biology, and draw attention to the important role of sulfotyrosine in mediating receptor-ligand interactions.",
        "Date": "2022-02-22",
        "Pages": "e2121568119",
        "Issue": 8.0,
        "Volume": 119.0,
        "Library Catalog": "pnas.org (Atypon)"
    }
]